# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную
# ценность. В случае с английским алфавитом очки распределяются так:
# ● A, E, I, O, U, L, N, S, T, R – 1 очко;
# ● D, G – 2 очка;
# ● B, C, M, P – 3 очка;
# ● F, H, V, W, Y – 4 очка;
# ● K – 5 очков;
# ● J, X – 8 очков;
# ● Q, Z – 10 очков.
# А русские буквы оцениваются так:
# ● А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# ● Д, К, Л, М, П, У – 2 очка;
# ● Б, Г, Ё, Ь, Я – 3 очка;
# ● Й, Ы – 4 очка;
# ● Ж, З, Х, Ц, Ч – 5 очков;
# ● Ш, Э, Ю – 8 очков;
# ● Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только
# английские, либо только русские буквы

# Input: ноутбук
# Output: 12

# list_1 = ['A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R','А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т']
# list_2 = ['D', 'G', 'Д', 'К', 'Л', 'М', 'П', 'У']
# list_3 = ['B', 'C', 'M', 'P', 'Б', 'Г', 'Ё', 'Ь', 'Я']
# list_4 = ['F', 'H', 'V', 'W', 'Y', 'Й', 'Ы']
# list_5 = ['K', 'Ж', 'З', 'Х', 'Ч', 'Ц']
# list_8 = ['J', 'X', 'Ш', 'Э', 'Ю']
# list_10 = ['Q', 'Z', 'Ф', 'Щ', 'Ъ']

# user_input = input("Введите слово: ")
# user_input = user_input.upper()
# count = 0

# for i in user_input:
#     if i in list_1:
#         count += 1
#     if i in list_2:
#         count += 2
#     if i in list_3:
#         count += 3
#     if i in list_4:
#         count += 4
#     if i in list_5:
#         count += 5
#     if i in list_8:
#         count += 8
#     if i in list_10:
#         count += 10

# print(f"Слово дает {count} очков")

# ##  Второй способ

slovar = {'A':'1', 'E':'1', 'I':'1', 'O':'1', 'U':'1', 'L':'1', 'N':'1', 'S':'1',
        'T':'1', 'R':'1', 'А':'1', 'В':'1', 'Е':'1', 'И':'1', 'Н':'1', 'О':'1',
        'Р':'1', 'С':'1', 'Т':'1', 'D':'2', 'G':'2', 'Д':'2', 'К':'2', 'Л':'2',
        'М':'2', 'П':'2', 'У':'2', 'B':'3', 'C':'3', 'M':'3', 'P':'3', 'Б':'3',
        'Г':'3', 'Ё':'3', 'Ь':'3', 'Я':'3','F':'4', 'H':'4', 'V':'4', 'W':'4',
        'Y':'4', 'Й':'4', 'Ы':'4', 'K':'5', 'Ж':'5', 'З':'5', 'Х':'5', 'Ч':'5',
        'Ц':'5', 'J':'5', 'X':'5', 'Ш':'5', 'Э':'5', 'Ю':'5','Q':'10', 'Z':'10',
        'Ф':'10', 'Щ':'10', 'Ъ':'10'}

user_input = input("Введите слово:\t ")
user_input = user_input.upper()
count = 0
for i in user_input:
    if i in slovar:
        count = count + int(slovar[i])
print(f"Слово дает {count} очков")